scripts_tpp/results/ycsb_a/1-2/output.log
<_io.BytesIO object at 0x7f11e85975b0> /home/ssd/yi/workloads/ycsb-0.15.0/bin/ycsb command database [options]
<_io.BytesIO object at 0x7f11e85975b0> 
Commands:
<_io.BytesIO object at 0x7f11e85975b0>     load           Execute the load phase
<_io.BytesIO object at 0x7f11e85975b0>     run            Execute the transaction phase
<_io.BytesIO object at 0x7f11e85975b0>     shell          Interactive mode
<_io.BytesIO object at 0x7f11e85975b0> 
Databases:
<_io.BytesIO object at 0x7f11e85975b0>     accumulo       https://github.com/brianfrankcooper/YCSB/tree/master/accumulo
<_io.BytesIO object at 0x7f11e85975b0>     accumulo1.6    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.6
<_io.BytesIO object at 0x7f11e85975b0>     accumulo1.7    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.7
<_io.BytesIO object at 0x7f11e85975b0>     accumulo1.8    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.8
<_io.BytesIO object at 0x7f11e85975b0>     aerospike      https://github.com/brianfrankcooper/YCSB/tree/master/aerospike
<_io.BytesIO object at 0x7f11e85975b0>     arangodb       https://github.com/brianfrankcooper/YCSB/tree/master/arangodb
<_io.BytesIO object at 0x7f11e85975b0>     arangodb3      https://github.com/brianfrankcooper/YCSB/tree/master/arangodb3
<_io.BytesIO object at 0x7f11e85975b0>     asynchbase     https://github.com/brianfrankcooper/YCSB/tree/master/asynchbase
<_io.BytesIO object at 0x7f11e85975b0>     azuredocumentdb https://github.com/brianfrankcooper/YCSB/tree/master/azuredocumentdb
<_io.BytesIO object at 0x7f11e85975b0>     azuretablestorage https://github.com/brianfrankcooper/YCSB/tree/master/azuretablestorage
<_io.BytesIO object at 0x7f11e85975b0>     basic          https://github.com/brianfrankcooper/YCSB/tree/master/basic
<_io.BytesIO object at 0x7f11e85975b0>     basicts        https://github.com/brianfrankcooper/YCSB/tree/master/basicts
<_io.BytesIO object at 0x7f11e85975b0>     cassandra-cql  https://github.com/brianfrankcooper/YCSB/tree/master/cassandra
<_io.BytesIO object at 0x7f11e85975b0>     cassandra2-cql https://github.com/brianfrankcooper/YCSB/tree/master/cassandra2
<_io.BytesIO object at 0x7f11e85975b0>     cloudspanner   https://github.com/brianfrankcooper/YCSB/tree/master/cloudspanner
<_io.BytesIO object at 0x7f11e85975b0>     couchbase      https://github.com/brianfrankcooper/YCSB/tree/master/couchbase
<_io.BytesIO object at 0x7f11e85975b0>     couchbase2     https://github.com/brianfrankcooper/YCSB/tree/master/couchbase2
<_io.BytesIO object at 0x7f11e85975b0>     dynamodb       https://github.com/brianfrankcooper/YCSB/tree/master/dynamodb
<_io.BytesIO object at 0x7f11e85975b0>     elasticsearch  https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch
<_io.BytesIO object at 0x7f11e85975b0>     elasticsearch5 https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch5
<_io.BytesIO object at 0x7f11e85975b0>     foundationdb   https://github.com/brianfrankcooper/YCSB/tree/master/foundationdb
<_io.BytesIO object at 0x7f11e85975b0>     geode          https://github.com/brianfrankcooper/YCSB/tree/master/geode
<_io.BytesIO object at 0x7f11e85975b0>     googlebigtable https://github.com/brianfrankcooper/YCSB/tree/master/googlebigtable
<_io.BytesIO object at 0x7f11e85975b0>     googledatastore https://github.com/brianfrankcooper/YCSB/tree/master/googledatastore
<_io.BytesIO object at 0x7f11e85975b0>     hbase098       https://github.com/brianfrankcooper/YCSB/tree/master/hbase098
<_io.BytesIO object at 0x7f11e85975b0>     hbase10        https://github.com/brianfrankcooper/YCSB/tree/master/hbase10
<_io.BytesIO object at 0x7f11e85975b0>     hbase12        https://github.com/brianfrankcooper/YCSB/tree/master/hbase12
<_io.BytesIO object at 0x7f11e85975b0>     hbase14        https://github.com/brianfrankcooper/YCSB/tree/master/hbase14
<_io.BytesIO object at 0x7f11e85975b0>     hbase20        https://github.com/brianfrankcooper/YCSB/tree/master/hbase20
<_io.BytesIO object at 0x7f11e85975b0>     hypertable     https://github.com/brianfrankcooper/YCSB/tree/master/hypertable
<_io.BytesIO object at 0x7f11e85975b0>     ignite         https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7f11e85975b0>     ignite-sql     https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7f11e85975b0>     infinispan     https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7f11e85975b0>     infinispan-cs  https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7f11e85975b0>     jdbc           https://github.com/brianfrankcooper/YCSB/tree/master/jdbc
<_io.BytesIO object at 0x7f11e85975b0>     kudu           https://github.com/brianfrankcooper/YCSB/tree/master/kudu
<_io.BytesIO object at 0x7f11e85975b0>     maprdb         https://github.com/brianfrankcooper/YCSB/tree/master/maprdb
<_io.BytesIO object at 0x7f11e85975b0>     maprjsondb     https://github.com/brianfrankcooper/YCSB/tree/master/maprjsondb
<_io.BytesIO object at 0x7f11e85975b0>     memcached      https://github.com/brianfrankcooper/YCSB/tree/master/memcached
<_io.BytesIO object at 0x7f11e85975b0>     mongodb        https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7f11e85975b0>     mongodb-async  https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7f11e85975b0>     nosqldb        https://github.com/brianfrankcooper/YCSB/tree/master/nosqldb
<_io.BytesIO object at 0x7f11e85975b0>     orientdb       https://github.com/brianfrankcooper/YCSB/tree/master/orientdb
<_io.BytesIO object at 0x7f11e85975b0>     rados          https://github.com/brianfrankcooper/YCSB/tree/master/rados
<_io.BytesIO object at 0x7f11e85975b0>     redis          https://github.com/brianfrankcooper/YCSB/tree/master/redis
<_io.BytesIO object at 0x7f11e85975b0>     rest           https://github.com/brianfrankcooper/YCSB/tree/master/rest
<_io.BytesIO object at 0x7f11e85975b0>     riak           https://github.com/brianfrankcooper/YCSB/tree/master/riak
<_io.BytesIO object at 0x7f11e85975b0>     rocksdb        https://github.com/brianfrankcooper/YCSB/tree/master/rocksdb
<_io.BytesIO object at 0x7f11e85975b0>     s3             https://github.com/brianfrankcooper/YCSB/tree/master/s3
<_io.BytesIO object at 0x7f11e85975b0>     solr           https://github.com/brianfrankcooper/YCSB/tree/master/solr
<_io.BytesIO object at 0x7f11e85975b0>     solr6          https://github.com/brianfrankcooper/YCSB/tree/master/solr6
<_io.BytesIO object at 0x7f11e85975b0>     tarantool      https://github.com/brianfrankcooper/YCSB/tree/master/tarantool
<_io.BytesIO object at 0x7f11e85975b0> 
Options:
<_io.BytesIO object at 0x7f11e85975b0>     -P file        Specify workload file
<_io.BytesIO object at 0x7f11e85975b0>     -cp path       Additional Java classpath entries
<_io.BytesIO object at 0x7f11e85975b0>     -jvm-args args Additional arguments to the JVM
<_io.BytesIO object at 0x7f11e85975b0>     -p key=value   Override workload property
<_io.BytesIO object at 0x7f11e85975b0>     -s             Print status to stderr
<_io.BytesIO object at 0x7f11e85975b0>     -target n      Target ops/sec (default: unthrottled)
<_io.BytesIO object at 0x7f11e85975b0>     -threads n     Number of client threads (default: 1)
<_io.BytesIO object at 0x7f11e85975b0> 
Workload Files:
    There are various predefined workloads under workloads/ directory.
    See https://github.com/brianfrankcooper/YCSB/wiki/Core-Properties
    for the list of workload properties.
<_io.TextIOWrapper name='<stderr>' mode='w' encoding='utf-8'> [OVERALL], RunTime(ms), 558962
[OVERALL], Throughput(ops/sec), 223628.79766424192
[TOTAL_GCS_PS_Scavenge], Count, 1247
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 5109
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9140156218132898
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1247
[TOTAL_GC_TIME], Time(ms), 5109
[TOTAL_GC_TIME_%], Time(%), 0.9140156218132898
[READ], Operations, 62497603
[READ], AverageLatency(us), 382.6441018385937
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 42111
[READ], 95thPercentileLatency(us), 1649
[READ], 99thPercentileLatency(us), 1938
[READ], Return=OK, 62497603
[UPDATE-FAILED], Operations, 62502397
[UPDATE-FAILED], AverageLatency(us), 422.06519463565536
[UPDATE-FAILED], MinLatency(us), 26
[UPDATE-FAILED], MaxLatency(us), 142463
[UPDATE-FAILED], 95thPercentileLatency(us), 1707
[UPDATE-FAILED], 99thPercentileLatency(us), 2565
[CLEANUP], Operations, 112
[CLEANUP], AverageLatency(us), 1396.0714285714287
[CLEANUP], MinLatency(us), 154
[CLEANUP], MaxLatency(us), 8239
[CLEANUP], 95thPercentileLatency(us), 2889
[CLEANUP], 99thPercentileLatency(us), 4735
[UPDATE], Operations, 0
[UPDATE], AverageLatency(us), NaN
[UPDATE], MinLatency(us), 9223372036854775807
[UPDATE], MaxLatency(us), 0
[UPDATE], 95thPercentileLatency(us), 0
[UPDATE], 99thPercentileLatency(us), 0
[UPDATE], Return=ERROR, 62502397
java -cp /home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/conf:/home/ssd/yi/workloads/ycsb-0.15.0/conf:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/log4j-1.2.17.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/spymemcached-2.11.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/memcached-binding-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-mapper-asl-1.9.13.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/HdrHistogram-2.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MemcachedClient -s -P /home/ssd/yi/workloads/ycsb-0.15.0/workloads/workloada -p memcached.hosts=127.0.0.1 -p memcached.port=11211 -p recordcount=1000000000 -p operationcount=125000000 -threads 112 -t